### Terraform Plan Output

<details><summary>Show Plan</summary>

```[command]/home/runner/work/_temp/703e55ae-105a-4efb-8507-fce67c93fe1a/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.certificate will be created
  + resource "aws_acm_certificate" "certificate" {
      + arn                       = (known after apply)
      + domain_name               = "api.zerodawndevops.com"
      + domain_validation_options = [
          + {
              + domain_name           = "api.zerodawndevops.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "api.zerodawndevops.com",
        ]
      + tags_all                  = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = true
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }

      + traffic_source (known after apply)
    }

  # aws_ecs_capacity_provider.ecs_capacity_provider will be created
  + resource "aws_ecs_capacity_provider" "ecs_capacity_provider" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "capacity-provider"
      + tags_all = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = "DISABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 1
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 2
            }
        }
    }

  # aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ecs-cluster"
      + tags_all = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }

      + setting (known after apply)
    }

  # aws_ecs_cluster_capacity_providers.associate_provider will be created
  + resource "aws_ecs_cluster_capacity_providers" "associate_provider" {
      + capacity_providers = [
          + "capacity-provider",
        ]
      + cluster_name       = "ecs-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "capacity-provider"
          + weight            = 100
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + availability_zone_rebalancing      = "ENABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "capacity-provider"
          + weight            = 100
        }

      + load_balancer {
          + container_name   = "health-check-backend"
          + container_port   = 4000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential    = true
                  + image        = "886436961770.dkr.ecr.us-east-1.amazonaws.com/health-check:latest"
                  + name         = "health-check-backend"
                  + portMappings = [
                      + {
                          + containerPort = 4000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "service-family"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "EC2",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_eip.eip will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "EIP"
        }
      + tags_all             = {
          + "Environment" = "development"
          + "Name"        = "EIP"
          + "Project"     = "health-check"
        }
      + vpc                  = (known after apply)
    }

  # aws_iam_instance_profile.ecs_node will be created
  + resource "aws_iam_instance_profile" "ecs_node" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-node-profile"
      + name_prefix = (known after apply)
      + path        = "/ecs/instance/"
      + role        = "ecs-node-role"
      + tags_all    = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.s3_access_policy will be created
  + resource "aws_iam_policy" "s3_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows access to specific S3 buckets"
      + id               = (known after apply)
      + name             = "s3-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::frontend-assets-development-8864/*",
                          + "arn:aws:s3:::frontend-assets-development-8864",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
    }

  # aws_iam_role.ecs_exec_role will be created
  + resource "aws_iam_role" "ecs_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "AllowEcsTaskExecutionRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_node_role will be created
  + resource "aws_iam_role" "ecs_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "AllowEcsTaskExecutionRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_exec_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_exec_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_node_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_node_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ecs-node-role"
    }

  # aws_iam_role_policy_attachment.ecs_task_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.s3_access will be created
  + resource "aws_iam_role_policy_attachment" "s3_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.ssm_managed_instance_core will be created
  + resource "aws_iam_role_policy_attachment" "ssm_managed_instance_core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ecs-node-role"
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Internet Gateway"
        }
      + tags_all = {
          + "Environment" = "development"
          + "Name"        = "Internet Gateway"
          + "Project"     = "health-check"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.launch_template will be created
  + resource "aws_launch_template" "launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ecs-template"
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + user_data              = "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj1lY3MtY2x1c3RlciA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCg=="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options (known after apply)
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags_all                                                     = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.http_listener will be created
  + resource "aws_lb_listener" "http_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.alb_target_group will be created
  + resource "aws_lb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "alb-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 15
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_nat_gateway.main will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NAT Gateway"
        }
      + tags_all                           = {
          + "Environment" = "development"
          + "Name"        = "NAT Gateway"
          + "Project"     = "health-check"
        }
    }

  # aws_route53_record.subdomain_record will be created
  + resource "aws_route53_record" "subdomain_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.zerodawndevops.com"
      + type            = "A"
      + zone_id         = "Z05189611ZPWCV5IJ0WKL"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "Private RT"
        }
      + tags_all         = {
          + "Environment" = "development"
          + "Name"        = "Private RT"
          + "Project"     = "health-check"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "Public RT"
        }
      + tags_all         = {
          + "Environment" = "development"
          + "Name"        = "Public RT"
          + "Project"     = "health-check"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "Security Group for ALB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs_node_sg will be created
  + resource "aws_security_group" "ecs_node_sg" {
      + arn                    = (known after apply)
      + description            = "Security Group for ECS EC2 instances"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs-cluster-node-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs_task_sg will be created
  + resource "aws_security_group" "ecs_task_sg" {
      + arn                    = (known after apply)
      + description            = "Security Group for ECS Tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs-cluster-task-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private 0"
        }
      + tags_all                                       = {
          + "Environment" = "development"
          + "Name"        = "Private 0"
          + "Project"     = "health-check"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private 1"
        }
      + tags_all                                       = {
          + "Environment" = "development"
          + "Name"        = "Private 1"
          + "Project"     = "health-check"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public 0"
        }
      + tags_all                                       = {
          + "Environment" = "development"
          + "Name"        = "Public 0"
          + "Project"     = "health-check"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public 1"
        }
      + tags_all                                       = {
          + "Environment" = "development"
          + "Name"        = "Public 1"
          + "Project"     = "health-check"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC"
        }
      + tags_all                             = {
          + "Environment" = "development"
          + "Name"        = "VPC"
          + "Project"     = "health-check"
        }
    }

  # aws_vpc_security_group_egress_rule.alb_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
    }

  # aws_vpc_security_group_egress_rule.ecs_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "ecs_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
    }

  # aws_vpc_security_group_egress_rule.ecs_task_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "ecs_task_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
    }

  # aws_vpc_security_group_ingress_rule.alb_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + to_port                = 80
    }

  # aws_vpc_security_group_ingress_rule.alb_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + to_port                = 443
    }

  # aws_vpc_security_group_ingress_rule.ecs_from_alb will be created
  + resource "aws_vpc_security_group_ingress_rule" "ecs_from_alb" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
    }

  # aws_vpc_security_group_ingress_rule.ecs_task_from_alb will be created
  + resource "aws_vpc_security_group_ingress_rule" "ecs_task_from_alb" {
      + arn                          = (known after apply)
      + from_port                    = 4000
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "development"
          + "Project"     = "health-check"
        }
      + to_port                      = 4000
    }

Plan: 46 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_url = (known after apply)
  + ecr_url = "886436961770.dkr.ecr.us-east-1.amazonaws.com/health-check"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_acm_certificate.certificate will be created%0A  + resource "aws_acm_certificate" "certificate" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "api.zerodawndevops.com"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "api.zerodawndevops.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "api.zerodawndevops.com",%0A        ]%0A      + tags_all                  = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A%0A      + options (known after apply)%0A    }%0A%0A  # aws_autoscaling_group.asg will be created%0A  + resource "aws_autoscaling_group" "asg" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 1%0A      + force_delete                     = true%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = (known after apply)%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 2%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 1%0A      + name                             = "asg"%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = (known after apply)%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + availability_zone_distribution (known after apply)%0A%0A      + capacity_reservation_specification (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + mixed_instances_policy (known after apply)%0A%0A      + tag {%0A          + key                 = "AmazonECSManaged"%0A          + propagate_at_launch = true%0A          + value               = "true"%0A        }%0A%0A      + traffic_source (known after apply)%0A    }%0A%0A  # aws_ecs_capacity_provider.ecs_capacity_provider will be created%0A  + resource "aws_ecs_capacity_provider" "ecs_capacity_provider" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "capacity-provider"%0A      + tags_all = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A%0A      + auto_scaling_group_provider {%0A          + auto_scaling_group_arn         = (known after apply)%0A          + managed_draining               = (known after apply)%0A          + managed_termination_protection = "DISABLED"%0A%0A          + managed_scaling {%0A              + instance_warmup_period    = (known after apply)%0A              + maximum_scaling_step_size = 1%0A              + minimum_scaling_step_size = 1%0A              + status                    = "ENABLED"%0A              + target_capacity           = 2%0A            }%0A        }%0A    }%0A%0A  # aws_ecs_cluster.cluster will be created%0A  + resource "aws_ecs_cluster" "cluster" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "ecs-cluster"%0A      + tags_all = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A%0A      + setting (known after apply)%0A    }%0A%0A  # aws_ecs_cluster_capacity_providers.associate_provider will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "associate_provider" {%0A      + capacity_providers = [%0A          + "capacity-provider",%0A        ]%0A      + cluster_name       = "ecs-cluster"%0A      + id                 = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 1%0A          + capacity_provider = "capacity-provider"%0A          + weight            = 100%0A        }%0A    }%0A%0A  # aws_ecs_service.service will be created%0A  + resource "aws_ecs_service" "service" {%0A      + availability_zone_rebalancing      = "ENABLED"%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = true%0A      + enable_execute_command             = false%0A      + force_new_deployment               = true%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = (known after apply)%0A      + name                               = "ecs-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + capacity_provider_strategy {%0A          + base              = 1%0A          + capacity_provider = "capacity-provider"%0A          + weight            = 100%0A        }%0A%0A      + load_balancer {%0A          + container_name   = "health-check-backend"%0A          + container_port   = 4000%0A          + target_group_arn = (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.task_definition will be created%0A  + resource "aws_ecs_task_definition" "task_definition" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + essential    = true%0A                  + image        = "886436961770.dkr.ecr.us-east-1.amazonaws.com/health-check:latest"%0A                  + name         = "health-check-backend"%0A                  + portMappings = [%0A                      + {%0A                          + containerPort = 4000%0A                          + protocol      = "tcp"%0A                        },%0A                    ]%0A                },%0A            ]%0A        )%0A      + cpu                      = "512"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "service-family"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "EC2",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + task_role_arn            = (known after apply)%0A      + track_latest             = false%0A%0A      + runtime_platform {%0A          + cpu_architecture        = "X86_64"%0A          + operating_system_family = "LINUX"%0A        }%0A    }%0A%0A  # aws_eip.eip will be created%0A  + resource "aws_eip" "eip" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name" = "EIP"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "development"%0A          + "Name"        = "EIP"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc                  = (known after apply)%0A    }%0A%0A  # aws_iam_instance_profile.ecs_node will be created%0A  + resource "aws_iam_instance_profile" "ecs_node" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "ecs-node-profile"%0A      + name_prefix = (known after apply)%0A      + path        = "/ecs/instance/"%0A      + role        = "ecs-node-role"%0A      + tags_all    = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # aws_iam_policy.s3_access_policy will be created%0A  + resource "aws_iam_policy" "s3_access_policy" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + description      = "Allows access to specific S3 buckets"%0A      + id               = (known after apply)%0A      + name             = "s3-access-policy"%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:GetObject",%0A                          + "s3:PutObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::frontend-assets-development-8864/*",%0A                          + "arn:aws:s3:::frontend-assets-development-8864",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_iam_role.ecs_exec_role will be created%0A  + resource "aws_iam_role" "ecs_exec_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = "AllowEcsTaskExecutionRole"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-task-execution-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_node_role will be created%0A  + resource "aws_iam_role" "ecs_node_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-node-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task_role will be created%0A  + resource "aws_iam_role" "ecs_task_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = "AllowEcsTaskExecutionRole"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-task-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_exec_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_exec_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_node_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_node_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"%0A      + role       = "ecs-node-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_task_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.s3_access will be created%0A  + resource "aws_iam_role_policy_attachment" "s3_access" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ssm_managed_instance_core will be created%0A  + resource "aws_iam_role_policy_attachment" "ssm_managed_instance_core" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"%0A      + role       = "ecs-node-role"%0A    }%0A%0A  # aws_internet_gateway.main will be created%0A  + resource "aws_internet_gateway" "main" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "Internet Gateway"%0A        }%0A      + tags_all = {%0A          + "Environment" = "development"%0A          + "Name"        = "Internet Gateway"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_launch_template.launch_template will be created%0A  + resource "aws_launch_template" "launch_template" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + id                     = (known after apply)%0A      + image_id               = (sensitive value)%0A      + instance_type          = "t2.micro"%0A      + latest_version         = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "ecs-template"%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + user_data              = "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj1lY3MtY2x1c3RlciA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCg=="%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + iam_instance_profile {%0A          + arn = (known after apply)%0A        }%0A%0A      + metadata_options (known after apply)%0A    }%0A%0A  # aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = (known after apply)%0A      + tags_all                                                     = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # aws_lb_listener.http_listener will be created%0A  + resource "aws_lb_listener" "http_listener" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # aws_lb_target_group.alb_target_group will be created%0A  + resource "aws_lb_target_group" "alb_target_group" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "alb-target-group"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 15%0A          + matcher             = "200"%0A          + path                = "/health"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 5%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A%0A      + target_group_health (known after apply)%0A%0A      + target_health_state (known after apply)%0A    }%0A%0A  # aws_nat_gateway.main will be created%0A  + resource "aws_nat_gateway" "main" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "NAT Gateway"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "development"%0A          + "Name"        = "NAT Gateway"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_route53_record.subdomain_record will be created%0A  + resource "aws_route53_record" "subdomain_record" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "api.zerodawndevops.com"%0A      + type            = "A"%0A      + zone_id         = "Z05189611ZPWCV5IJ0WKL"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # aws_route_table.private will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + nat_gateway_id             = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "Private RT"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "development"%0A          + "Name"        = "Private RT"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + gateway_id                 = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "Public RT"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "development"%0A          + "Name"        = "Public RT"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_security_group.alb_sg will be created%0A  + resource "aws_security_group" "alb_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security Group for ALB"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "alb-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_security_group.ecs_node_sg will be created%0A  + resource "aws_security_group" "ecs_node_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security Group for ECS EC2 instances"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "ecs-cluster-node-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_security_group.ecs_task_sg will be created%0A  + resource "aws_security_group" "ecs_task_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security Group for ECS Tasks"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "ecs-cluster-task-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Private 0"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Private 0"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Private 1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Private 1"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Public 0"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Public 0"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Public 1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Public 1"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.main will be created%0A  + resource "aws_vpc" "main" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "VPC"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "development"%0A          + "Name"        = "VPC"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.alb_egress will be created%0A  + resource "aws_vpc_security_group_egress_rule" "alb_egress" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.ecs_egress will be created%0A  + resource "aws_vpc_security_group_egress_rule" "ecs_egress" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.ecs_task_egress will be created%0A  + resource "aws_vpc_security_group_egress_rule" "ecs_task_egress" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.alb_http will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "alb_http" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + to_port                = 80%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.alb_https will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "alb_https" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + to_port                = 443%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.ecs_from_alb will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "ecs_from_alb" {%0A      + arn                          = (known after apply)%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "-1"%0A      + referenced_security_group_id = (known after apply)%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.ecs_task_from_alb will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "ecs_task_from_alb" {%0A      + arn                          = (known after apply)%0A      + from_port                    = 4000%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "tcp"%0A      + referenced_security_group_id = (known after apply)%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + to_port                      = 4000%0A    }%0A%0APlan: 46 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + alb_url = (known after apply)%0A  + ecr_url = "886436961770.dkr.ecr.us-east-1.amazonaws.com/health-check"%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_acm_certificate.certificate will be created%0A  + resource "aws_acm_certificate" "certificate" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "api.zerodawndevops.com"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "api.zerodawndevops.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "api.zerodawndevops.com",%0A        ]%0A      + tags_all                  = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A%0A      + options (known after apply)%0A    }%0A%0A  # aws_autoscaling_group.asg will be created%0A  + resource "aws_autoscaling_group" "asg" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 1%0A      + force_delete                     = true%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = (known after apply)%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 2%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 1%0A      + name                             = "asg"%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = (known after apply)%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + availability_zone_distribution (known after apply)%0A%0A      + capacity_reservation_specification (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + mixed_instances_policy (known after apply)%0A%0A      + tag {%0A          + key                 = "AmazonECSManaged"%0A          + propagate_at_launch = true%0A          + value               = "true"%0A        }%0A%0A      + traffic_source (known after apply)%0A    }%0A%0A  # aws_ecs_capacity_provider.ecs_capacity_provider will be created%0A  + resource "aws_ecs_capacity_provider" "ecs_capacity_provider" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "capacity-provider"%0A      + tags_all = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A%0A      + auto_scaling_group_provider {%0A          + auto_scaling_group_arn         = (known after apply)%0A          + managed_draining               = (known after apply)%0A          + managed_termination_protection = "DISABLED"%0A%0A          + managed_scaling {%0A              + instance_warmup_period    = (known after apply)%0A              + maximum_scaling_step_size = 1%0A              + minimum_scaling_step_size = 1%0A              + status                    = "ENABLED"%0A              + target_capacity           = 2%0A            }%0A        }%0A    }%0A%0A  # aws_ecs_cluster.cluster will be created%0A  + resource "aws_ecs_cluster" "cluster" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "ecs-cluster"%0A      + tags_all = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A%0A      + setting (known after apply)%0A    }%0A%0A  # aws_ecs_cluster_capacity_providers.associate_provider will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "associate_provider" {%0A      + capacity_providers = [%0A          + "capacity-provider",%0A        ]%0A      + cluster_name       = "ecs-cluster"%0A      + id                 = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 1%0A          + capacity_provider = "capacity-provider"%0A          + weight            = 100%0A        }%0A    }%0A%0A  # aws_ecs_service.service will be created%0A  + resource "aws_ecs_service" "service" {%0A      + availability_zone_rebalancing      = "ENABLED"%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = true%0A      + enable_execute_command             = false%0A      + force_new_deployment               = true%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = (known after apply)%0A      + name                               = "ecs-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + capacity_provider_strategy {%0A          + base              = 1%0A          + capacity_provider = "capacity-provider"%0A          + weight            = 100%0A        }%0A%0A      + load_balancer {%0A          + container_name   = "health-check-backend"%0A          + container_port   = 4000%0A          + target_group_arn = (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.task_definition will be created%0A  + resource "aws_ecs_task_definition" "task_definition" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + essential    = true%0A                  + image        = "886436961770.dkr.ecr.us-east-1.amazonaws.com/health-check:latest"%0A                  + name         = "health-check-backend"%0A                  + portMappings = [%0A                      + {%0A                          + containerPort = 4000%0A                          + protocol      = "tcp"%0A                        },%0A                    ]%0A                },%0A            ]%0A        )%0A      + cpu                      = "512"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "service-family"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "EC2",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + task_role_arn            = (known after apply)%0A      + track_latest             = false%0A%0A      + runtime_platform {%0A          + cpu_architecture        = "X86_64"%0A          + operating_system_family = "LINUX"%0A        }%0A    }%0A%0A  # aws_eip.eip will be created%0A  + resource "aws_eip" "eip" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name" = "EIP"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "development"%0A          + "Name"        = "EIP"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc                  = (known after apply)%0A    }%0A%0A  # aws_iam_instance_profile.ecs_node will be created%0A  + resource "aws_iam_instance_profile" "ecs_node" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "ecs-node-profile"%0A      + name_prefix = (known after apply)%0A      + path        = "/ecs/instance/"%0A      + role        = "ecs-node-role"%0A      + tags_all    = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # aws_iam_policy.s3_access_policy will be created%0A  + resource "aws_iam_policy" "s3_access_policy" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + description      = "Allows access to specific S3 buckets"%0A      + id               = (known after apply)%0A      + name             = "s3-access-policy"%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:GetObject",%0A                          + "s3:PutObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::frontend-assets-development-8864/*",%0A                          + "arn:aws:s3:::frontend-assets-development-8864",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_iam_role.ecs_exec_role will be created%0A  + resource "aws_iam_role" "ecs_exec_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = "AllowEcsTaskExecutionRole"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-task-execution-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_node_role will be created%0A  + resource "aws_iam_role" "ecs_node_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-node-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task_role will be created%0A  + resource "aws_iam_role" "ecs_task_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = "AllowEcsTaskExecutionRole"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-task-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_exec_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_exec_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_node_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_node_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"%0A      + role       = "ecs-node-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_task_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.s3_access will be created%0A  + resource "aws_iam_role_policy_attachment" "s3_access" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ssm_managed_instance_core will be created%0A  + resource "aws_iam_role_policy_attachment" "ssm_managed_instance_core" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"%0A      + role       = "ecs-node-role"%0A    }%0A%0A  # aws_internet_gateway.main will be created%0A  + resource "aws_internet_gateway" "main" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "Internet Gateway"%0A        }%0A      + tags_all = {%0A          + "Environment" = "development"%0A          + "Name"        = "Internet Gateway"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_launch_template.launch_template will be created%0A  + resource "aws_launch_template" "launch_template" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + id                     = (known after apply)%0A      + image_id               = (sensitive value)%0A      + instance_type          = "t2.micro"%0A      + latest_version         = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "ecs-template"%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + user_data              = "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj1lY3MtY2x1c3RlciA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCg=="%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + iam_instance_profile {%0A          + arn = (known after apply)%0A        }%0A%0A      + metadata_options (known after apply)%0A    }%0A%0A  # aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = (known after apply)%0A      + tags_all                                                     = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # aws_lb_listener.http_listener will be created%0A  + resource "aws_lb_listener" "http_listener" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # aws_lb_target_group.alb_target_group will be created%0A  + resource "aws_lb_target_group" "alb_target_group" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "alb-target-group"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 15%0A          + matcher             = "200"%0A          + path                = "/health"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 5%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A%0A      + target_group_health (known after apply)%0A%0A      + target_health_state (known after apply)%0A    }%0A%0A  # aws_nat_gateway.main will be created%0A  + resource "aws_nat_gateway" "main" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "NAT Gateway"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "development"%0A          + "Name"        = "NAT Gateway"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_route53_record.subdomain_record will be created%0A  + resource "aws_route53_record" "subdomain_record" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "api.zerodawndevops.com"%0A      + type            = "A"%0A      + zone_id         = "Z05189611ZPWCV5IJ0WKL"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # aws_route_table.private will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + nat_gateway_id             = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "Private RT"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "development"%0A          + "Name"        = "Private RT"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + gateway_id                 = (known after apply)%0A                # (11 unchanged attributes hidden)%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "Public RT"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "development"%0A          + "Name"        = "Public RT"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_security_group.alb_sg will be created%0A  + resource "aws_security_group" "alb_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security Group for ALB"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "alb-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_security_group.ecs_node_sg will be created%0A  + resource "aws_security_group" "ecs_node_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security Group for ECS EC2 instances"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "ecs-cluster-node-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_security_group.ecs_task_sg will be created%0A  + resource "aws_security_group" "ecs_task_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Security Group for ECS Tasks"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "ecs-cluster-task-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Private 0"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Private 0"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Private 1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Private 1"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Public 0"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Public 0"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Public 1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment" = "development"%0A          + "Name"        = "Public 1"%0A          + "Project"     = "health-check"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.main will be created%0A  + resource "aws_vpc" "main" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "VPC"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "development"%0A          + "Name"        = "VPC"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.alb_egress will be created%0A  + resource "aws_vpc_security_group_egress_rule" "alb_egress" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.ecs_egress will be created%0A  + resource "aws_vpc_security_group_egress_rule" "ecs_egress" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_egress_rule.ecs_task_egress will be created%0A  + resource "aws_vpc_security_group_egress_rule" "ecs_task_egress" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.alb_http will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "alb_http" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + to_port                = 80%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.alb_https will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "alb_https" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags_all               = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + to_port                = 443%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.ecs_from_alb will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "ecs_from_alb" {%0A      + arn                          = (known after apply)%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "-1"%0A      + referenced_security_group_id = (known after apply)%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A    }%0A%0A  # aws_vpc_security_group_ingress_rule.ecs_task_from_alb will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "ecs_task_from_alb" {%0A      + arn                          = (known after apply)%0A      + from_port                    = 4000%0A      + id                           = (known after apply)%0A      + ip_protocol                  = "tcp"%0A      + referenced_security_group_id = (known after apply)%0A      + security_group_id            = (known after apply)%0A      + security_group_rule_id       = (known after apply)%0A      + tags_all                     = {%0A          + "Environment" = "development"%0A          + "Project"     = "health-check"%0A        }%0A      + to_port                      = 4000%0A    }%0A%0APlan: 46 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + alb_url = (known after apply)%0A  + ecr_url = "886436961770.dkr.ecr.us-east-1.amazonaws.com/health-check"%0A

::set-output name=stderr::

::set-output name=exitcode::0
```
</details>